iam.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-24 Sat 15:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to Applied Mathematics</title>
<meta name="author" content="Akash Gopinath" />
<meta name="description" content="Applied Mathematics Notes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Introduction to Applied Mathematics</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org59c9ddc">Pre Requisites</a></li>
<li><a href="#org2f3dc66">Introduction to Mechanics</a>
<ul>
<li><a href="#org59989b5">Chapter 1: Preliminaries</a></li>
<li><a href="#org9aa1377">Chapter 2: Equations of Motion</a></li>
<li><a href="#org2feb92d">Chapter 3: Solutions for 1D Motion</a></li>
<li><a href="#orgbb9c5a9">Chapter 4: Solutions for 2D Motion</a></li>
<li><a href="#org4f4081f">Chapter 5: Polar Coordinates</a></li>
</ul>
</li>
<li><a href="#org94fdab0"><span class="todo TODO">TODO</span> </a></li>
</ul>
</div>
</div>
<div id="outline-container-org59c9ddc" class="outline-2">
<h2 id="org59c9ddc">Pre Requisites</h2>
<div class="outline-text-2" id="text-org59c9ddc">
<p>
A course on Calculus, Differential Equations and Fourier Series is recommended.
</p>

<p>
This course is split into two parts.
</p>

<ol class="org-ol">
<li>Introduction to Mechanics</li>
<li>Introduction to Mathematical Modelling</li>
</ol>
</div>
</div>
<div id="outline-container-org2f3dc66" class="outline-2">
<h2 id="org2f3dc66">Introduction to Mechanics</h2>
<div class="outline-text-2" id="text-org2f3dc66">
</div>
<div id="outline-container-org59989b5" class="outline-3">
<h3 id="org59989b5">Chapter 1: Preliminaries</h3>
<div class="outline-text-3" id="text-org59989b5">
<p>
Covered basics of Vectors, Differential Equations and Dimensional Analysis
</p>

<ul class="org-ul">
<li><a href="./iam/1_ Preliminaries.pdf">Preliminaries</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9aa1377" class="outline-3">
<h3 id="org9aa1377">Chapter 2: Equations of Motion</h3>
<div class="outline-text-3" id="text-org9aa1377">
<ul class="org-ul">
<li><a href="./iam/2_ Equations of Motion.pdf">Equations of Motion</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2feb92d" class="outline-3">
<h3 id="org2feb92d">Chapter 3: Solutions for 1D Motion</h3>
<div class="outline-text-3" id="text-org2feb92d">
<ul class="org-ul">
<li><a href="./iam/3_ Solutions for Motion 1D.pdf">Solutions of Motion in 1D</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbb9c5a9" class="outline-3">
<h3 id="orgbb9c5a9">Chapter 4: Solutions for 2D Motion</h3>
<div class="outline-text-3" id="text-orgbb9c5a9">
<ul class="org-ul">
<li><a href="./iam/4_ Solutions to Motion in 2D.pdf">Solutions of Motion in 2D</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4f4081f" class="outline-3">
<h3 id="org4f4081f">Chapter 5: Polar Coordinates</h3>
<div class="outline-text-3" id="text-org4f4081f">
<ul class="org-ul">
<li><a href="./iam/5_ Polar Coordinates.pdf">Motion in Polar Coordinates</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org94fdab0" class="outline-2">
<h2 id="org94fdab0"><span class="todo TODO">TODO</span> </h2>
<div class="outline-text-2" id="text-org94fdab0">
<ul class="org-ul">
<li>Add Mathematical Modelling Notes</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Akash Gopinath</p>
<p class="date">Created: 2024-02-24 Sat 15:11</p>
</div>
</body>
</html>
